OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f47j53.h
extern __at(0x0EBF) __sfr PPSCON;

typedef struct
  {
  unsigned IOLOCK               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PPSCONbits_t;

extern __at(0x0EBF) volatile __PPSCONbits_t PPSCONbits;

#define _IOLOCK                 0x01

//==============================================================================

extern __at(0x0EC0) __sfr RPOR0;
extern __at(0x0EC1) __sfr RPOR1;
extern __at(0x0EC2) __sfr RPOR2;
extern __at(0x0EC3) __sfr RPOR3;
extern __at(0x0EC4) __sfr RPOR4;
extern __at(0x0EC5) __sfr RPOR5;
extern __at(0x0EC6) __sfr RPOR6;
extern __at(0x0EC7) __sfr RPOR7;
extern __at(0x0EC8) __sfr RPOR8;
extern __at(0x0EC9) __sfr RPOR9;
extern __at(0x0ECA) __sfr RPOR10;
extern __at(0x0ECB) __sfr RPOR11;
extern __at(0x0ECC) __sfr RPOR12;
extern __at(0x0ECD) __sfr RPOR13;
extern __at(0x0ED1) __sfr RPOR17;
extern __at(0x0ED2) __sfr RPOR18;
extern __at(0x0ED3) __sfr RPOR19;
extern __at(0x0ED4) __sfr RPOR20;
extern __at(0x0ED5) __sfr RPOR21;
extern __at(0x0ED6) __sfr RPOR22;
extern __at(0x0ED7) __sfr RPOR23;
extern __at(0x0ED8) __sfr RPOR24;
extern __at(0x0EE1) __sfr RPINR1;
extern __at(0x0EE2) __sfr RPINR2;
extern __at(0x0EE3) __sfr RPINR3;
extern __at(0x0EE4) __sfr RPINR4;
extern __at(0x0EE6) __sfr RPINR6;
extern __at(0x0EE7) __sfr RPINR15;
extern __at(0x0EE8) __sfr RPINR7;
extern __at(0x0EE9) __sfr RPINR8;
extern __at(0x0EEA) __sfr RPINR9;
extern __at(0x0EF2) __sfr RPINR12;
extern __at(0x0EF3) __sfr RPINR13;
extern __at(0x0EF4) __sfr RPINR14;
extern __at(0x0EF7) __sfr RPINR16;
extern __at(0x0EF8) __sfr RPINR17;
extern __at(0x0EFC) __sfr RPINR21;
extern __at(0x0EFD) __sfr RPINR22;
extern __at(0x0EFE) __sfr RPINR23;
extern __at(0x0EFF) __sfr RPINR24;

//==============================================================================
//        CCP10CON Bits

extern __at(0x0F00) __sfr CCP10CON;

typedef union
  {
  struct
    {
    unsigned CCP10M0            : 1;
    unsigned CCP10M1            : 1;
    unsigned CCP10M2            : 1;
    unsigned CCP10M3            : 1;
    unsigned DC10B0             : 1;
    unsigned DC10B1             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP10M             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC10B              : 2;
    unsigned                    : 2;
    };
  } __CCP10CONbits_t;

extern __at(0x0F00) volatile __CCP10CONbits_t CCP10CONbits;

#define _CCP10M0                0x01
#define _CCP10M1                0x02
#define _CCP10M2                0x04
#define _CCP10M3                0x08
#define _DC10B0                 0x10
#define _DC10B1                 0x20

//==============================================================================

extern __at(0x0F01) __sfr CCPR10L;
extern __at(0x0F02) __sfr CCPR10H;

//==============================================================================
//        CCP9CON Bits

extern __at(0x0F03) __sfr CCP9CON;

typedef union
  {
  struct
    {
    unsigned CCP9M0             : 1;
    unsigned CCP9M1             : 1;
    unsigned CCP9M2             : 1;
    unsigned CCP9M3             : 1;
    unsigned DC9B0              : 1;
    unsigned DC9B1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP9M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC9B               : 2;
    unsigned                    : 2;
    };
  } __CCP9CONbits_t;

extern __at(0x0F03) volatile __CCP9CONbits_t CCP9CONbits;

#define _CCP9M0                 0x01
#define _CCP9M1                 0x02
#define _CCP9M2                 0x04
#define _CCP9M3                 0x08
#define _DC9B0                  0x10
#define _DC9B1                  0x20

//==============================================================================

extern __at(0x0F04) __sfr CCPR9L;
extern __at(0x0F05) __sfr CCPR9H;

//==============================================================================
//        CCP8CON Bits

extern __at(0x0F06) __sfr CCP8CON;

typedef union
  {
  struct
    {
    unsigned CCP8M0             : 1;
    unsigned CCP8M1             : 1;
    unsigned CCP8M2             : 1;
    unsigned CCP8M3             : 1;
    unsigned DC8B0              : 1;
    unsigned DC8B1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP8M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC8B               : 2;
    unsigned                    : 2;
    };
  } __CCP8CONbits_t;

extern __at(0x0F06) volatile __CCP8CONbits_t CCP8CONbits;

#define _CCP8M0                 0x01
#define _CCP8M1                 0x02
#define _CCP8M2                 0x04
#define _CCP8M3                 0x08
#define _DC8B0                  0x10
#define _DC8B1                  0x20

//==============================================================================

extern __at(0x0F07) __sfr CCPR8L;
extern __at(0x0F08) __sfr CCPR8H;

//==============================================================================
//        CCP7CON Bits

extern __at(0x0F09) __sfr CCP7CON;

typedef union
  {
  struct
    {
    unsigned CCP7M0             : 1;
    unsigned CCP7M1             : 1;
    unsigned CCP7M2             : 1;
    unsigned CCP7M3             : 1;
    unsigned DC7B0              : 1;
    unsigned DC7B1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP7M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC7B               : 2;
    unsigned                    : 2;
    };
  } __CCP7CONbits_t;

extern __at(0x0F09) volatile __CCP7CONbits_t CCP7CONbits;

